LAST_WATCH_POTION = {
    "name": "אשמורת אחרונה",
    "materials": ["לוטוס דם", "קשקשי לטאת ענק", "שורש אלף אצילי"],
    "technic": "ייבוש וכתישה",
    "description": "מונע מדמות גוססת למות למשך 10 דק', משאיר טעם צורב בפה",
}

TRUTH_SYRUP_POTION = {
    "name": "סם אמת",
    "materials": ["לילית שחורה", "פטריות מעמקים", "שורש אלף אצילי"],
    "technic": "התססה",
    "description": "הדמות אומרת את האמת לחמשת הדקות הקרובות ולא יכולה לעצור בעצמה, אך זוכרת הכל בתום השפעת השיקוי. שיקוי דביק.",
}

WEAKNESS_POISON_POTION = {
    "name": "רעל חולשה",
    "materials": ["לילית שחורה", "לוטוס דם", "דרדר דרקון"],
    "technic": "חליטה",
    "description": "הדמות חשה חולשה למשך 10 דק', לא מוריד נקפ, יוצר תחושת חיבור קוסמי.",
}

COUNTER_POTION = {
    "name": "נוגדן רעלים",
    "materials": ["לילית שחורה", "קשקשי לטאת ענק", "דרדר דרקון"],
    "technic": "בישול",
    "description": "מנטרל תסמיני הרעלה לאחר השתייה, גורם לאופטימיות ועקצוץ.",
}

HEALTH_POTION = {
    "name": "מרקחת בריאות",
    "materials": ["לוטוס דם", "דרדר דרקון", "תפרחת השעווה"],
    "technic": "בישול",
    "description": "מחזיר 1 נק'פ, גורם לטעם לוואי חזק",
}

FAILED_POTION_VALIDATE_MATERIAL = {
    "name": "נוגדן רעלים",
    "materials": ["לילית שחורה", "קשקשי לטאת ענק", "fail"],
    "technic": "בישול",
    "description": "מנטרל תסמיני הרעלה לאחר השתייה, גורם לאופטימיות ועקצוץ.",
}

FAILED_POTION_VALIDATE_TECHNIC = {
    "name": "נוגדן רעלים",
    "materials": ["לילית שחורה", "קשקשי לטאת ענק", "דרדר דרקון"],
    "technic": "fail",
    "description": "מנטרל תסמיני הרעלה לאחר השתייה, גורם לאופטימיות ועקצוץ.",
}

FAILED_POTION_TO_HIGH_MATERIAL = {
    "name": "נוגדן רעלים",
    "materials": [
        "לילית שחורה",
        "שורש אלף אצילי",
        "קשקשי לטאת ענק",
        "לוטוס דם",
        "דרדר דרקון",
        "פטריות מעמקים",
        "תפרחת השעווה",
    ],
    "technic": "בישול",
    "description": "מנטרל תסמיני הרעלה לאחר השתייה, גורם לאופטימיות ועקצוץ.",
}

FAILED_POTION_TO_LOW_MATERIAL = {
    "name": "נוגדן רעלים",
    "materials": ["לילית שחורה", "שורש אלף אצילי"],
    "technic": "בישול",
    "description": "מנטרל תסמיני הרעלה לאחר השתייה, גורם לאופטימיות ועקצוץ.",
}
